[{
  "_id": {
    "$oid": "6503b569fc926dcee6cbe660"
  },
  "title": "IT Support Analyst (Level 1/2)",
  "employer": "Talison Lithium",
  "createddate": "2023-09-01",
  "closedate": {
    "$date": "2023-09-30T00:00:00.000Z"
  },
  "imageUrl": "photo/logo.png",
  "adcontent": "Information Systems and Technology (IST) compromises Information Technology (IT), and Operational Technology (OT) at Talison deals with technologies that can improve control and decision-making associated with operations, maintenance and support services. The strategy is to develop clear outcomes for IT and OT projects based on close consultation with stakeholders and an excellent understanding of the technology capabilities and limitations.\n\nIST remit includes selection, implementation and support of data production systems and process control systems (PCS), PCS and data standards, OT servers and network, IT & OT cybersecurity, data systems and PCS stand-alone projects and OT component of large projects such as new plants and expansions.  As well as supporting end users with required hardware and software, networking and user support.\n\nAbout the Role \n\nWe are seeking an experienced, resourceful and detail-oriented individual who is willing to show initiative and contribute a positive and adaptable attitude to our multi-functional Information Technology (IT) team. \n\nReporting to the Service Desk Supervisor, you will play a pivotal role as part of a small and dedicated team of IT professionals.  Bring your enthusiastic approach and customer service brilliance with the ability to manage multiple requests with different priorities, within agreed time frames. \n\nThe primary responsibilities of this role are to answer calls and emails regarding technical problems, general IT and application support, support the configuration and maintenance of desktops, laptops, desk phones, mobile devices, data logging systems and basic networking support.\n\nThis is a permanent, full-time position working an attractive residential roster (8 days on, 6 days off, 10 hours per day). \n\n\nAbout the Candidate\n\nYou will have a technical background in information technology support and will have worked as part of a service desk team previously and display:\n\nexperience in Windows 10, 11 and Microsoft Office 365;\nexperience providing outstanding support to a range of users;\nhigh level computer literacy and problem solving skills;\nexcellent interpersonal and communication skills;\nnetwork troubleshooting;\nan ability to demonstrate initiative and attention to detail;\nwell-organised and have a professional manner with focus and proactive approach to customer service;\na team player yet be able to work independently when required;\nadaptability. A willingness to learn is key in this role; \ncreates a positive customer support experience that builds strong relationships;\nlog and resolve incidents and requests, and manage IT outages and disruptions;\nsetup, configure and deploy new IT hardware across the company;\ncreate and maintain documentation;\nwork closely with the IT Team and take initiative to improve IT operations;\neffectively prioritize and handle multiple tasks simultaneously;\ngather information relating to outages and work with senior resources to minimize downtime; and\nthe candidate will have two (2) years’ experience in a similar role.\n\nBenefits of working with Talison\n\nThe benefits of working with Talison are many and include:\n\nresidential role with a family and lifestyle friendly roster – be home with your family every night; \nattractive salary, commensurate with skills and experience;\nincome protection insurance;\nlife Insurance for company superannuation employees;\nsalary sacrifice options for remote area housing, motor vehicles and superannuation; and \nparticipation in site performance-based  incentive scheme.\n \n\nSupporting a diverse workforce\n\nTalison strongly encourage applicants of diverse backgrounds and experience to apply. Talison takes pride in its unique location and the excellent work/life balance offering that our employees enjoy. Talison recognises that we are strengthened by diversity and are committed to providing a work environment that strives for inclusivity and where everyone is treated fairly and with respect. \n\nHow to Apply\n\nApplications, including a cover letter, CV, and referees, can be submitted via SEEK.\n\nSuccessful applicants are required to reside within 60 minutes’ drive of the Greenbushes Lithium Operation to comply with Talison’s Distance from Work Standard."
},
{
  "_id": {
    "$oid": "6503b64dfc926dcee6cbe661"
  },
  "title": "IT Systems Administrator",
  "employer": "Airnorth",
  "createddate": "2023-08-11",
  "closedate": {
    "$date": "2023-10-31T00:00:00.000Z"
  },
  "imageUrl": "photo/logo.png",
  "adcontent": "3 to 6 month contract\nLocated in Dalby\nImmediate start\nOperating from the ICT department, the Technical Officer - Devices & Mobility will report to the Infrastructure Team Leader and will work closely with the other Technical Officers, Service Desk Staff, ICT Team Leaders, Project Managers, internal stakeholders, vendors and support partners\nAct as 2nd tier support to service desk\nMaintaining Company Servers, both virtual and physical, and their hardware peripherals.\nAdministering Domain Services, Active Directory, and Group Policies.\nEnsuring data integrity, backups, and disaster recovery.\nConfiguring and maintaining new servers.\nImplementing server operating systems and hardware upgrades.\nResolving software and hardware issues and coordinating with external service providers.\nEvaluating and testing infrastructure proposals for compatibility.\nRecommending infrastructure improvements for efficiency.\nDocumenting technical infrastructure and support procedures.\nDelivering top-notch customer service.\nAssisting the Service Desk and mentoring staff with complex issues.\nManaging the Standard Operating Environment (SOE) and deploying apps via Intune.\nInstalling patches, drivers, and third-party software.\nContributing to project work as directed.\nConfiguring, maintaining, and backing up/restoring SQL instances and databases for Core Business applications.\nTo excel in this role, you should demonstrate:\nMicrosoft and/or VMWare certification with at least two years of enterprise server administration experience.\nStrong analytical and problem-solving skills in an IT support environment.\nExpertise in developing strategies for server technical infrastructure maintenance and upgrades.\nExceptional communication and relationship-building skills.\nExtensive experience with Microsoft Endpoint Configuration Manager (SCCM), including software packaging, SOE maintenance/deployment, and update deployment.\nRequired knowledge includes:\nA relevant tertiary qualification in IT, Computer Science, or related field OR equivalent experience.\nIndustry certifications in VMWare or Microsoft virtualization technologies.\nITIL v3 Foundation certification.\nSolid experience with VMware, Windows Server, storage, disaster recovery, and networking technologies.\nFamiliarity with data management techniques and SQL Server.\nProficiency in Microsoft O365, SharePoint Administration, and various software/services like IIS, Exchange, and Intune.\nThis is for an immediate commencement!\n\nTo be considered, please submit your resume and a cover letter. For further information, please contact Pauline Stephens on 07 3305 5801 or 0434 249 988"
},
{
  "_id": {
    "$oid": "6503b9d75993b971296e0cfb"
  },
  "title": "Network Operations Engineer",
  "employer": "Pivotel Satellite Pty Limited",
  "createddate": "2023-08-02",
  "closedate": {
    "$date": "2023-08-31T00:00:00.000Z"
  },
  "imageUrl": "photo/logo.png",
  "adcontent": "3 to 6 month contract\nLocated in Dalby\nImmediate start\nOperating from the ICT department, the Technical Officer - Devices & Mobility will report to the Infrastructure Team Leader and will work closely with the other Technical Officers, Service Desk Staff, ICT Team Leaders, Project Managers, internal stakeholders, vendors and support partners\nAct as 2nd tier support to service desk\nMaintaining Company Servers, both virtual and physical, and their hardware peripherals.\nAdministering Domain Services, Active Directory, and Group Policies.\nEnsuring data integrity, backups, and disaster recovery.\nConfiguring and maintaining new servers.\nImplementing server operating systems and hardware upgrades.\nResolving software and hardware issues and coordinating with external service providers.\nEvaluating and testing infrastructure proposals for compatibility.\nRecommending infrastructure improvements for efficiency.\nDocumenting technical infrastructure and support procedures.\nDelivering top-notch customer service.\nAssisting the Service Desk and mentoring staff with complex issues.\nManaging the Standard Operating Environment (SOE) and deploying apps via Intune.\nInstalling patches, drivers, and third-party software.\nContributing to project work as directed.\nConfiguring, maintaining, and backing up/restoring SQL instances and databases for Core Business applications.\nTo excel in this role, you should demonstrate:\nMicrosoft and/or VMWare certification with at least two years of enterprise server administration experience.\nStrong analytical and problem-solving skills in an IT support environment.\nExpertise in developing strategies for server technical infrastructure maintenance and upgrades.\nExceptional communication and relationship-building skills.\nExtensive experience with Microsoft Endpoint Configuration Manager (SCCM), including software packaging, SOE maintenance/deployment, and update deployment.\nRequired knowledge includes:\nA relevant tertiary qualification in IT, Computer Science, or related field OR equivalent experience.\nIndustry certifications in VMWare or Microsoft virtualization technologies.\nITIL v3 Foundation certification.\nSolid experience with VMware, Windows Server, storage, disaster recovery, and networking technologies.\nFamiliarity with data management techniques and SQL Server.\nProficiency in Microsoft O365, SharePoint Administration, and various software/services like IIS, Exchange, and Intune.\nThis is for an immediate commencement!\n\nTo be considered, please submit your resume and a cover letter. For further information, please contact Pauline Stephens on 07 3305 5801 or 0434 249 988"
},
{
  "_id": {
    "$oid": "6503c6834b8c88aea99d0a00"
  },
  "title": "IT Desktop Support Analyst",
  "employer": "Grand Prix Panel and Paint",
  "createddate": "2023-09-01",
  "closedate": {
    "$date": "2023-09-30T00:00:00.000Z"
  },
  "imageUrl": "Photo/logo.png",
  "adcontent": "Are you passionate about providing exceptional IT support and resolving technical issues? Do you thrive in a dynamic and fast-paced environment? If so, we invite you to join our team as an IT Desktop Support Analyst at Grand Prix Auto Group.\n\nAbout Us:\n\nGrand Prix Auto Group is a family owned and operated automotive business in the northern suburbs of Brisbane. The group consists of several dealerships covering the following vehicle manufacturers – Mazda, Hyundai, Peugeot and Chery.\n\nPosition Overview:\n\nWe are seeking a talented IT Desktop Support Analyst to join our team in Brisbane, Australia. In this role, you will be responsible for providing technical support to end-users, troubleshooting hardware and software issues, and ensuring a smooth and efficient IT environment.\n\nKey Responsibilities:\n\nRespond to IT support requests via phone, email, or in person and resolve technical issues promptly.\nDiagnose and troubleshoot hardware, software, and network problems.\nInstall, configure, and maintain desktops, laptops, and other end-user devices.\nCollaborate with service providers to implement software upgrades and patches.\nProvide excellent customer service and maintain a high level of user satisfaction.\nDocument and maintain accurate records of support requests and resolutions.\nAssist with user training and education on IT-related topics.\nQualifications:\n\n2-3 years’ experience in a similar IT support role.\nProven experience in IT desktop support or a similar role.\nStrong knowledge of Windows desktop and server operating systems.\nFamiliarity with Microsoft Office Suite and productivity software.\nModerate understanding of networking concepts.\nExcellent problem-solving and communication skills.\nA customer-focused attitude with a passion for delivering top-notch support.\nBenefits:\n\nCompetitive salary.\nProfessional development opportunities.\nFriendly and collaborative work environment.\nOpportunities for career growth within the company.\n "
}]